# LoseSavedOrientation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ToggleViewFailures..::..LoseSavedOrientation Property
BuiltInFailures..::..ToggleViewFailures Class See Also
---
The stored orientation will be lost.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LoseSavedOrientation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LoseSavedOrientation As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LoseSavedOrientation {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ToggleViewFailures Class
Autodesk.Revit.DB Namespace